
package com.quotorcloud.quotor.common.core.constant;

/**
 */
public interface CommonConstants {

//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------是否是会员---------------------------

	/**
	 * 是
	 */
	Integer IS_MEMBER = 1;

	/**
	 * 否
	 */
	Integer NOT_MEMBER = 2;

//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------卡模板类型---------------------------

	/**
	 * 储值卡
	 */
	Integer STORED_VALUE_CARD = 1;

	/**
	 * 折扣卡
	 */
	Integer DISCOUNT_CARD = 2;

	/**
	 * 时段卡
	 */
	Integer TIME_FRAME_CARD = 3;

	/**
	 * 总次卡
	 */
	Integer TOTAL_DEGREE_CARD = 4;

	/**
	 * 分次卡
	 */
	Integer GRADATION_CARD = 5;

//	----------------------------------------------------------------------
//	----------------------------------------------------------------------
//	----------------------------------------------------------------------

	/**
	 * 卡内容
	 */
	Integer CONDITION_CARD_CONTENT = 1;

	/**
	 * 购卡赠送
	 */
	Integer CONDITION_BUY_CARD_GIVE = 2;

	/**
	 * 充值赠送
	 */
	Integer CONDITION_TOPUP_GIVE = 3;

//	----------------------------------------------------------------------
//	----------------------------------------------------------------------
//	----------------------------------------------------------------------
	/**
	 * 项目类别
	 */
	Integer CONDITION_PROJECT = 1;

	/**
	 * 产品类别
	 */
	Integer CONDITION_PRODUCT = 2;

	/**
	 *套餐
	 */
	Integer CONDITION_SET_MEAL = 3;


//	------------------------------------------------------------------
//	------------------------------------------------------------------
//	------------------------------------------------------------------

	/**
	 * 卡片
	 */
	Integer CONDITION_CARD = 4;

	/**
	 * 劵
	 */
	Integer CONDITION_DISCOUNTS = 5;

//	------------------------------------------------------------------
//	------------------------------------------------------------------
//	------------------------------------------------------------------

	/**
	 * 微信扫码
	 */
	Integer NATIVE = 1;

	/**
	 * 支付宝扫码
	 */
	Integer ZFB_CODE_PAY = 2;

	/**
	 * 小程序
	 */
	Integer JSAPI =3;

//	-------------------------------------------------------------------
//	-------------------------------------------------------------------
//	-------------------------------------------------------------------

	/**
	 * 未支付
	 */
	Integer NOT_PAY = 2;

	/**
	 * 已支付
	 */
	Integer PAY = 1;

//	-------------------------------------------------------------------
//	-------------------------------------------------------------------
//	-------------------------------------------------------------------


	/**
	 * 招聘
	 */
	Integer INVITE = 1;

	/**
	 * 下店
	 */
	Integer INN = 2;

	/**
	 * 入库
	 */
	Integer IN_INVENTORY =1;

	/**
	 * 出库
	 */
	Integer OUT_INVENTORY = 2;

	/**
	 * 发布
	 */
	Integer ISSUE = 1;

	/**
	 * 待发布
	 */
	Integer AWAIT_ISSUE = 2;

	/**
	 * 下架
	 */
	Integer SOLD_OUT = 3;

	/**
	 * 删除
	 */
	Integer STATUS_DEL = 1;
	/**
	 * 正常
	 */
	Integer STATUS_NORMAL = 0;

	/**
	 * 在职
	 */
	Integer STATUS_IN_JOB = 1;

	/**
	 * 离职
	 */
	Integer STATUS_OUT_JOB = 2;

	/**
	 * 男
	 */
	Integer STATUS_MAN = 1;

	/**
	 * 女
	 */
	Integer STATUS_WOMAN = 0;

	/**
	 * 分隔符
	 */
	String SEPARATOR = ",";

	/**
	 * 锁定
	 */
	String STATUS_LOCK = "9";

	/**
	 * 菜单
	 */
	String MENU = "0";

	/**
	 * 编码
	 */
	String UTF8 = "UTF-8";

	/**
	 * JSON 资源
	 */
	String CONTENT_TYPE = "application/json; charset=utf-8";

	/**
	 * 前端工程名
	 */
	String FRONT_END_PROJECT = "quotor-ui";

	/**
	 * 后端工程名
	 */
	String BACK_END_PROJECT = "quotor";

	/**
	 * 成功标记
	 */
	Integer SUCCESS = 0;
	/**
	 * 失败标记
	 */
	Integer FAIL = 1;

	/**
	 * 验证码前缀
	 */
	String DEFAULT_CODE_KEY = "DEFAULT_CODE_KEY_";
}
